TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_УстановкаНастроекНазначенияРазгрузки/гкс_УстановкаНастроекНазначенияРазгрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гкс_УстановкаНастроекНазначенияРазгрузки</name>
  <registerRecords>InformationRegister.гкс_ДополнительныеНастройкиНазначенияРазгрузки</registerRecords>
  <registerRecords>InformationRegister.гкс_НастройкиНазначенияРазгрузки</registerRecords>
  <attributes>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПеревозки</name>
    <comment>ERP-1377</comment>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НазначенияРазгрузки</name>
    <attributes>
      <name>СлужебнаяНоменклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Силос</name>
      <type>
        <types>CatalogRef.гкс_ТочкиМаршрута</types>
      </type>
    </attributes>
    <attributes>
      <name>ЯмаРазгрузки</name>
      <type>
        <types>CatalogRef.гкс_ТочкиМаршрута</types>
      </type>
    </attributes>
    <attributes>
      <name>ТочкаВъезда</name>
      <comment>Точка въезда</comment>
      <type>
        <types>CatalogRef.гкс_СтруктураПЛК</types>
      </type>
    </attributes>
    <attributes>
      <name>Дополнительный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_НастройкиНазначенияРазгрузки/гкс_НастройкиНазначенияРазгрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_НастройкиНазначенияРазгрузки</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Силос</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </resources>
  <resources>
    <name>ЯмаРазгрузки</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </resources>
  <resources>
    <name>ТочкаВъезда</name>
    <comment>Точка въезда</comment>
    <type>
      <types>CatalogRef.гкс_СтруктураПЛК</types>
    </type>
  </resources>
  <resources>
    <name>Действует</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПеревозки</name>
    <comment>ERP-1377</comment>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СлужебнаяНоменклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_ДополнительныеНастройкиНазначенияРазгрузки/гкс_ДополнительныеНастройкиНазначенияРазгрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_ДополнительныеНастройкиНазначенияРазгрузки</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ТочкаВъезда</name>
    <comment>Точка въезда</comment>
    <type>
      <types>CatalogRef.гкс_СтруктураПЛК</types>
    </type>
  </resources>
  <resources>
    <name>Действует</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПеревозки</name>
    <comment>ERP-1377</comment>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СлужебнаяНоменклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Силос</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЯмаРазгрузки</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_СегментацияКачестваНоменклатуры/гкс_СегментацияКачестваНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_СегментацияКачестваНоменклатуры</name>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СлужебнаяНоменклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_СоответствияОбъектовСРПВ/гкс_СоответствияОбъектовСРПВ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_СоответствияОбъектовСРПВ</name>
  <resources>
    <name>Ссылка</name>
    <type>
      <types>DefinedType.гкс_ИнтеграцияСРПВСправочники</types>
    </type>
  </resources>
  <dimensions>
    <name>ТипОбъектаСРПВ</name>
    <type>
      <types>EnumRef.гкс_ТипыОбъектовСРПВ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторСРПВ</name>
    <comment>Идентификатор объекта СРПВ</comment>
    <type>
      <types>DefinedType.гкс_ИдентификаторыСРПВ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_УстановкаНастроекНазначенияРазгрузки/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	УстановитьВидимостьДоступностьЭлементовФормы();
	УстановитьСписокВыбораСлужебнойНоменклатуры();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
		
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.Ответственный = Пользователи.ТекущийПользователь();
	Если Перечисления.гкс_ТипыТранспортныхСредствДоставки.ЭтоЖДПеревозка(ТекущийОбъект.ВидПеревозки) Тогда
		РазделитьНазначенияРазгрузкиДляЖДПеревозки(ТекущийОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Перечисления.гкс_ТипыТранспортныхСредствДоставки.ЭтоЖДПеревозка(Объект.ВидПеревозки) Тогда
		ПроверитьЗаполнениеНазначенияРазгрузкиДляЖДПеревозки(Объект.НазначенияРазгрузки.Выгрузить(), Отказ);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	НоменклатураПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПеревозкиПриИзменении(Элемент)
	Объект.НазначенияРазгрузки.Очистить();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьТекущимиНастройками(Команда)
	
	ОчиститьСообщения();
	Если Объект.НазначенияРазгрузки.Количество() Тогда
		
		ТекстВопроса = НСтр("ru='В документе заполнена таблица ""Назначения разгрузки"". Перезаполнить?'");
		ОповещениеОтвет = Новый ОписаниеОповещения("ОтветЗаполнитьТекущимиНастройками", ЭтотОбъект);
		ПоказатьВопрос(ОповещениеОтвет, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		
	Иначе
		ЗаполнитьТекущимиНастройкамиНаСервере();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НоменклатураПриИзмененииНаСервере()
		
	УстановитьСписокВыбораСлужебнойНоменклатуры();
	
	// перезаполним табличную часть
	ЗаполнитьТекущимиНастройкамиНаСервере();

КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервере
Процедура УстановитьВидимостьДоступностьЭлементовФормы()
			
	Если Параметры.Ключ.Пустая() И Параметры.Свойство("ИзАРМа") Тогда
		Элементы.ТочкаМаршрута.Видимость = Ложь;
		Элементы.ВидПеревозки.Видимость = Ложь;
		Элементы.Номер.Видимость = Ложь;
		Элементы.Дата.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветЗаполнитьТекущимиНастройками(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьТекущимиНастройкамиНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТекущимиНастройкамиНаСервере()
	
	Объект.НазначенияРазгрузки.Очистить();
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НастройкиНазначенияРазгрузки.Силос КАК Силос,
	|	НастройкиНазначенияРазгрузки.СлужебнаяНоменклатура КАК СлужебнаяНоменклатура,
	|	НастройкиНазначенияРазгрузки.ЯмаРазгрузки КАК ЯмаРазгрузки,
	|	НастройкиНазначенияРазгрузки.ТочкаВъезда КАК ТочкаВъезда
	|ИЗ
	|	РегистрСведений.гкс_НастройкиНазначенияРазгрузки.СрезПоследних(, ТочкаМаршрута = &ТочкаМаршрута
	|	И ВидПеревозки = &ВидПеревозки
	|	И Номенклатура = &Номенклатура) КАК НастройкиНазначенияРазгрузки
	|ГДЕ
	|	НастройкиНазначенияРазгрузки.Действует
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НастройкиНазначенияРазгрузки.Силос,
	|	НастройкиНазначенияРазгрузки.СлужебнаяНоменклатура,
	|	НастройкиНазначенияРазгрузки.ЯмаРазгрузки,
	|	НастройкиНазначенияРазгрузки.ТочкаВъезда
	|ИЗ
	|	РегистрСведений.гкс_ДополнительныеНастройкиНазначенияРазгрузки.СрезПоследних(, ТочкаМаршрута = &ТочкаМаршрута
	|	И ВидПеревозки = &ВидПеревозки
	|	И Номенклатура = &Номенклатура) КАК НастройкиНазначенияРазгрузки
	|ГДЕ
	|	НастройкиНазначенияРазгрузки.Действует
	|
	|УПОРЯДОЧИТЬ ПО
	|	СлужебнаяНоменклатура";
	
	Запрос.УстановитьПараметр("ТочкаМаршрута", Объект.ТочкаМаршрута);
	Запрос.УстановитьПараметр("ВидПеревозки", Объект.ВидПеревозки);
	Запрос.УстановитьПараметр("Номенклатура", Объект.Номенклатура);	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		ДанныеЗапроса = РезультатЗапроса.Выгрузить();
	    Объект.НазначенияРазгрузки.Загрузить(ДанныеЗапроса);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСписокВыбораСлужебнойНоменклатуры()

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СегментацияКачестваНоменклатуры.СлужебнаяНоменклатура КАК СлужебнаяНоменклатура
	|ИЗ
	|	РегистрСведений.гкс_СегментацияКачестваНоменклатуры КАК СегментацияКачестваНоменклатуры
	|ГДЕ
	|	СегментацияКачестваНоменклатуры.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Объект.Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();

	Если Не РезультатЗапроса.Пустой() Тогда
		ЗначенияДляСпискаВыбора = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("СлужебнаяНоменклатура");
	Иначе
		ЗначенияДляСпискаВыбора = Новый Массив;
	КонецЕсли;
	
	Элементы.НазначенияРазгрузкиСлужебнаяНоменклатура
		.СписокВыбора.ЗагрузитьЗначения(ЗначенияДляСпискаВыбора);
	
КонецПроцедуры

// Для ЖД перевозки доступно указание нескольких мест разгрузки для одной служебной номенклатуры.
// Если служебная номенклатура указана в Назначениях разгрузки один раз, то запись будет добавлена в 
// 		РС.гкс_НастройкиНазначенияРазгрузки;
// Иначе первая по порядку запись будет добавлена в РС.гкс_НастройкиНазначенияРазгрузки, а остальные записи  
// 		по служебной номенклатуре будут добавлены в РС.гкс_ДополнительныеНастройкиНазначенияРазгрузки
// 
// Параметры:
//  ТекущийОбъект - ДокументОбъект.гкс_УстановкаНастроекНазначенияРазгрузки - Текущий объект
&НаСервере
Процедура РазделитьНазначенияРазгрузкиДляЖДПеревозки(ТекущийОбъект)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НазначенияРазгрузки", ТекущийОбъект.НазначенияРазгрузки.Выгрузить());
	Запрос.Текст = ТекстЗапросаРазделенияНазначенийРазгрузки();
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ТекущийОбъект.НазначенияРазгрузки.Загрузить(РезультатЗапроса.Выгрузить());	
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция ТекстЗапросаРазделенияНазначенийРазгрузки()
	Возврат
	"ВЫБРАТЬ
	|	НазначенияРазгрузки.НомерСтроки КАК НомерСтроки,
	|	НазначенияРазгрузки.СлужебнаяНоменклатура КАК СлужебнаяНоменклатура,
	|	НазначенияРазгрузки.Силос КАК Силос,
	|	НазначенияРазгрузки.ЯмаРазгрузки КАК ЯмаРазгрузки,
	|	НазначенияРазгрузки.ТочкаВъезда КАК ТочкаВъезда,
	|	НазначенияРазгрузки.Дополнительный КАК Дополнительный
	|ПОМЕСТИТЬ НазначенияРазгрузки
	|ИЗ
	|	&НазначенияРазгрузки КАК НазначенияРазгрузки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НазначенияРазгрузки.СлужебнаяНоменклатура КАК СлужебнаяНоменклатура,
	|	МИНИМУМ(НазначенияРазгрузки.НомерСтроки) КАК НомерСтроки
	|ПОМЕСТИТЬ НесколькоМестРазгрузки
	|ИЗ
	|	НазначенияРазгрузки КАК НазначенияРазгрузки
	|СГРУППИРОВАТЬ ПО
	|	НазначенияРазгрузки.СлужебнаяНоменклатура
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НазначенияРазгрузки.Силос) > 1
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НазначенияРазгрузки.СлужебнаяНоменклатура,
	|	МИНИМУМ(НазначенияРазгрузки.НомерСтроки)
	|ИЗ
	|	НазначенияРазгрузки КАК НазначенияРазгрузки
	|СГРУППИРОВАТЬ ПО
	|	НазначенияРазгрузки.СлужебнаяНоменклатура
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НазначенияРазгрузки.ЯмаРазгрузки) > 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НесколькоМестРазгрузки.СлужебнаяНоменклатура КАК СлужебнаяНоменклатура,
	|	МАКСИМУМ(НесколькоМестРазгрузки.НомерСтроки) КАК НомерСтроки
	|ПОМЕСТИТЬ ДополнительныеНазначенияРазгрузки
	|ИЗ
	|	НесколькоМестРазгрузки КАК НесколькоМестРазгрузки
	|СГРУППИРОВАТЬ ПО
	|	НесколькоМестРазгрузки.СлужебнаяНоменклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НазначенияРазгрузки.НомерСтроки КАК НомерСтроки,
	|	НазначенияРазгрузки.СлужебнаяНоменклатура КАК СлужебнаяНоменклатура,
	|	НазначенияРазгрузки.Силос КАК Силос,
	|	НазначенияРазгрузки.ЯмаРазгрузки КАК ЯмаРазгрузки,
	|	НазначенияРазгрузки.ТочкаВъезда КАК ТочкаВъезда,
	|	ВЫБОР
	|		КОГДА ДополнительныеНазначенияРазгрузки.НомерСтроки ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ
	|		НЕ ДополнительныеНазначенияРазгрузки.НомерСтроки = НазначенияРазгрузки.НомерСтроки
	|	КОНЕЦ КАК Дополнительный
	|ИЗ
	|	НазначенияРазгрузки КАК НазначенияРазгрузки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДополнительныеНазначенияРазгрузки КАК ДополнительныеНазначенияРазгрузки
	|		ПО НазначенияРазгрузки.СлужебнаяНоменклатура = ДополнительныеНазначенияРазгрузки.СлужебнаяНоменклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
КонецФункции

&НаСервереБезКонтекста
Процедура ПроверитьЗаполнениеНазначенияРазгрузкиДляЖДПеревозки(НазначенияРазгрузки, Отказ)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	Запрос.УстановитьПараметр("НазначенияРазгрузки", НазначенияРазгрузки);
	ПроверитьСоответствиеПутейЯмДляЖДПеревозки(Запрос, Отказ);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПроверитьСоответствиеПутейЯмДляЖДПеревозки(Запрос, Отказ)
	
	Если Не ПолучитьФункциональнуюОпцию("гкс_ИспользоватьИнтеграциюСРПВ") Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина); // Для чтения СоответствияОбъектовСРПВ
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НазначенияРазгрузки.ЯмаРазгрузки КАК ЯмаРазгрузки
	|ПОМЕСТИТЬ НазначенияРазгрузки
	|ИЗ
	|	&НазначенияРазгрузки КАК НазначенияРазгрузки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НазначенияРазгрузки.ЯмаРазгрузки КАК ЯмаРазгрузки,
	|	ЕСТЬNULL(СправочникСтруктураПЛК.Ссылка, ЗНАЧЕНИЕ(Справочник.гкс_СтруктураПЛК.ПустаяСсылка)) КАК Путь
	|ПОМЕСТИТЬ НазначенияРазгрузкиСПутями
	|ИЗ
	|	НазначенияРазгрузки КАК НазначенияРазгрузки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.гкс_СтруктураПЛК КАК СправочникСтруктураПЛК
	|		ПО НазначенияРазгрузки.ЯмаРазгрузки = СправочникСтруктураПЛК.ТочкаМаршрута
	|		И НЕ СправочникСтруктураПЛК.ПометкаУдаления
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Путь
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НазначенияРазгрузкиСПутями.ЯмаРазгрузки КАК ЯмаРазгрузки,
	|	ИСТИНА КАК НеЗаданоСоответствиеПути,
	|	ЛОЖЬ КАК НеЗаданИдентификаторСРПВ
	|ПОМЕСТИТЬ ПроблемныеНазначенияРазгрузки
	|ИЗ
	|	НазначенияРазгрузкиСПутями КАК НазначенияРазгрузкиСПутями
	|ГДЕ
	|	НазначенияРазгрузкиСПутями.Путь = ЗНАЧЕНИЕ(Справочник.гкс_СтруктураПЛК.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НазначенияРазгрузкиСПутями.ЯмаРазгрузки,
	|	ЛОЖЬ,
	|	ИСТИНА
	|ИЗ
	|	НазначенияРазгрузкиСПутями КАК НазначенияРазгрузкиСПутями
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гкс_СоответствияОбъектовСРПВ КАК СоответствияОбъектовСРПВ
	|		ПО НазначенияРазгрузкиСПутями.Путь = СоответствияОбъектовСРПВ.Ссылка
	|ГДЕ
	|	СоответствияОбъектовСРПВ.ИдентификаторСРПВ ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(ПроблемныеНазначенияРазгрузки.ЯмаРазгрузки) КАК ЯмаРазгрузкиПредставление,
	|	МАКСИМУМ(ПроблемныеНазначенияРазгрузки.НеЗаданоСоответствиеПути) КАК НеЗаданоСоответствиеПути,
	|	МАКСИМУМ(ПроблемныеНазначенияРазгрузки.НеЗаданИдентификаторСРПВ) КАК НеЗаданИдентификаторСРПВ
	|ИЗ
	|	ПроблемныеНазначенияРазгрузки КАК ПроблемныеНазначенияРазгрузки
	|СГРУППИРОВАТЬ ПО
	|	ПроблемныеНазначенияРазгрузки.ЯмаРазгрузки,
	|	ПРЕДСТАВЛЕНИЕ(ПроблемныеНазначенияРазгрузки.ЯмаРазгрузки)";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ЧастиСообщения = Новый Массив;
	ЧастиСообщения.Добавить(
		НСтр("ru = 'Для следующих ям разгрузки есть проблемы сопоставления с объектами СРПВ:'"));
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаСообщения = СтрШаблон("%1: %2 %3", 
			Выборка.ЯмаРазгрузкиПредставление, 
			Формат(Выборка.НеЗаданоСоответствиеПути, "БЛ=; БИ='<не найден путь в Структуре ПЛК>';"),
			Формат(Выборка.НеЗаданИдентификаторСРПВ, "БЛ=; БИ='<не найдено соответствие объекту СРПВ>';"));
		
		ЧастиСообщения.Добавить(СтрокаСообщения);
	КонецЦикла;
	
	ОбщегоНазначения.СообщитьПользователю(СтрСоединить(ЧастиСообщения, Символы.ПС),,,, Отказ);
	
КонецПроцедуры

#КонецОбласти
